Revit 2024 API
BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromScaledLink Property
 Can't acquire coordinates from a link that is scaled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotAcquireCoordinatesFromScaledLink { get; }
Visual Basic
Public Shared ReadOnly Property CannotAcquireCoordinatesFromScaledLink As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotAcquireCoordinatesFromScaledLink {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace